; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p11---int100n150-m25---int100c150---s257---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level6 level6)
(sum level0 level10 level10)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level19 level19)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level6 level7)
(sum level1 level10 level11)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level19 level20)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level6 level8)
(sum level2 level10 level12)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level19 level21)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level6 level9)
(sum level3 level10 level13)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level19 level22)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level6 level10)
(sum level4 level10 level14)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level19 level23)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level6 level11)
(sum level5 level10 level15)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level19 level24)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level6 level12)
(sum level6 level10 level16)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level19 level25)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level6 level13)
(sum level7 level10 level17)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level19 level26)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level6 level14)
(sum level8 level10 level18)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level19 level27)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level6 level15)
(sum level9 level10 level19)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level19 level28)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level6 level16)
(sum level10 level10 level20)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level19 level29)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level6 level17)
(sum level11 level10 level21)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level19 level30)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level6 level18)
(sum level12 level10 level22)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level19 level31)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level6 level19)
(sum level13 level10 level23)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level19 level32)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level6 level20)
(sum level14 level10 level24)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level19 level33)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level6 level21)
(sum level15 level10 level25)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level19 level34)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level6 level22)
(sum level16 level10 level26)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level19 level35)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level6 level23)
(sum level17 level10 level27)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level19 level36)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level6 level24)
(sum level18 level10 level28)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level19 level37)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level6 level25)
(sum level19 level10 level29)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level19 level38)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level6 level26)
(sum level20 level10 level30)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level19 level39)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level6 level27)
(sum level21 level10 level31)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level19 level40)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level6 level28)
(sum level22 level10 level32)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level19 level41)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level6 level29)
(sum level23 level10 level33)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level19 level42)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level6 level30)
(sum level24 level10 level34)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level19 level43)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level6 level31)
(sum level25 level10 level35)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level19 level44)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level6 level32)
(sum level26 level10 level36)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level19 level45)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level6 level33)
(sum level27 level10 level37)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level19 level46)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level6 level34)
(sum level28 level10 level38)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level19 level47)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level6 level35)
(sum level29 level10 level39)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level19 level48)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level6 level36)
(sum level30 level10 level40)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level19 level49)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level6 level37)
(sum level31 level10 level41)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level19 level50)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level6 level38)
(sum level32 level10 level42)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level19 level51)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level6 level39)
(sum level33 level10 level43)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level19 level52)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level6 level40)
(sum level34 level10 level44)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level19 level53)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level6 level41)
(sum level35 level10 level45)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level19 level54)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level1 level37)
(sum level36 level6 level42)
(sum level36 level10 level46)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level19 level55)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level1 level38)
(sum level37 level6 level43)
(sum level37 level10 level47)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level19 level56)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level38 level1 level39)
(sum level38 level6 level44)
(sum level38 level10 level48)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level19 level57)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level39 level1 level40)
(sum level39 level6 level45)
(sum level39 level10 level49)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level19 level58)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level40 level1 level41)
(sum level40 level6 level46)
(sum level40 level10 level50)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level19 level59)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level41 level1 level42)
(sum level41 level6 level47)
(sum level41 level10 level51)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level19 level60)
(sum level41 level22 level63)
(sum level42 level1 level43)
(sum level42 level6 level48)
(sum level42 level10 level52)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level19 level61)
(sum level42 level22 level64)
(sum level43 level1 level44)
(sum level43 level6 level49)
(sum level43 level10 level53)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level19 level62)
(sum level44 level1 level45)
(sum level44 level6 level50)
(sum level44 level10 level54)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level19 level63)
(sum level45 level1 level46)
(sum level45 level6 level51)
(sum level45 level10 level55)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level19 level64)
(sum level46 level1 level47)
(sum level46 level6 level52)
(sum level46 level10 level56)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level47 level1 level48)
(sum level47 level6 level53)
(sum level47 level10 level57)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level48 level1 level49)
(sum level48 level6 level54)
(sum level48 level10 level58)
(sum level48 level16 level64)
(sum level49 level1 level50)
(sum level49 level6 level55)
(sum level49 level10 level59)
(sum level50 level1 level51)
(sum level50 level6 level56)
(sum level50 level10 level60)
(sum level51 level1 level52)
(sum level51 level6 level57)
(sum level51 level10 level61)
(sum level52 level1 level53)
(sum level52 level6 level58)
(sum level52 level10 level62)
(sum level53 level1 level54)
(sum level53 level6 level59)
(sum level53 level10 level63)
(sum level54 level1 level55)
(sum level54 level6 level60)
(sum level54 level10 level64)
(sum level55 level1 level56)
(sum level55 level6 level61)
(sum level56 level1 level57)
(sum level56 level6 level62)
(sum level57 level1 level58)
(sum level57 level6 level63)
(sum level58 level1 level59)
(sum level58 level6 level64)
(sum level59 level1 level60)
(sum level60 level1 level61)
(sum level61 level1 level62)
(sum level62 level1 level63)
(sum level63 level1 level64)

(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l0 l3)
(fuelcost level6 l0 l3)
(connected l0 l4)
(fuelcost level22 l0 l4)
(connected l0 l5)
(fuelcost level24 l0 l5)
(connected l1 l2)
(fuelcost level17 l1 l2)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l1)
(fuelcost level17 l2 l1)
(connected l2 l4)
(fuelcost level1 l2 l4)
(connected l2 l5)
(fuelcost level10 l2 l5)
(connected l3 l0)
(fuelcost level6 l3 l0)
(connected l3 l4)
(fuelcost level1 l3 l4)
(connected l3 l5)
(fuelcost level16 l3 l5)
(connected l4 l0)
(fuelcost level22 l4 l0)
(connected l4 l2)
(fuelcost level1 l4 l2)
(connected l4 l3)
(fuelcost level1 l4 l3)
(connected l5 l0)
(fuelcost level24 l5 l0)
(connected l5 l2)
(fuelcost level10 l5 l2)
(connected l5 l3)
(fuelcost level16 l5 l3)

(at t0 l5)
(fuel t0 level64)
(= (total-cost) 0)

(at p0 l5)
(at p1 l4)
(at p2 l4)
(at p3 l5)
(at p4 l0)
(at p5 l3)
(at p6 l0)
(at p7 l4)
(at p8 l0)
(at p9 l4)
(at p10 l5)
)

(:goal
(and
(at p0 l2)
(at p1 l0)
(at p2 l3)
(at p3 l4)
(at p4 l1)
(at p5 l0)
(at p6 l3)
(at p7 l2)
(at p8 l2)
(at p9 l2)
(at p10 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 0 of 11
2. (load p10 t0 l5)
   deleted: (at p10 l5)
   added: (in p10 t0)
   goals met: 0 of 11
3. (load p0 t0 l5)
   deleted: (at p0 l5)
   added: (in p0 t0)
   goals met: 0 of 11
4. (drive t0 l5 l3 level48 level16 level64)
   deleted: (at t0 l5) (fuel t0 level64)
   added: (at t0 l3) (fuel t0 level48)
   goals met: 0 of 11
5. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 11
6. (drive t0 l3 l4 level47 level1 level48)
   deleted: (at t0 l3) (fuel t0 level48)
   added: (at t0 l4) (fuel t0 level47)
   goals met: 0 of 11
7. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 0 of 11
8. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 0 of 11
9. (drive t0 l4 l0 level25 level22 level47)
   deleted: (at t0 l4) (fuel t0 level47)
   added: (at t0 l0) (fuel t0 level25)
   goals met: 0 of 11
10. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 1 of 11
11. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 2 of 11
12. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 3 of 11
13. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 3 of 11
14. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 3 of 11
15. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 3 of 11
16. (drive t0 l0 l3 level19 level6 level25)
   deleted: (at t0 l0) (fuel t0 level25)
   added: (at t0 l3) (fuel t0 level19)
   goals met: 3 of 11
17. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 4 of 11
18. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 5 of 11
19. (drive t0 l3 l4 level18 level1 level19)
   deleted: (at t0 l3) (fuel t0 level19)
   added: (at t0 l4) (fuel t0 level18)
   goals met: 5 of 11
20. (load p7 t0 l4)
   deleted: (at p7 l4)
   added: (in p7 t0)
   goals met: 5 of 11
21. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 5 of 11
22. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 6 of 11
23. (drive t0 l4 l2 level17 level1 level18)
   deleted: (at t0 l4) (fuel t0 level18)
   added: (at t0 l2) (fuel t0 level17)
   goals met: 6 of 11
24. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 7 of 11
25. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 8 of 11
26. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 9 of 11
27. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 10 of 11
28. (drive t0 l2 l1 level0 level17 level17)
   deleted: (at t0 l2) (fuel t0 level17)
   added: (at t0 l1) (fuel t0 level0)
   goals met: 10 of 11
29. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 11 of 11
